import make_text_Data
#基本エネルギー系を最初に出力
print('1,草エネルギー,草,エネルギーカード,0,,,0,-,-,,基本エネルギーカード,,,,,,,,,,,,,,')
print('2,炎エネルギー,炎,エネルギーカード,0,,,0,-,-,,基本エネルギーカード,,,,,,,,,,,,,,')
print('3,水エネルギー,水,エネルギーカード,0,,,0,-,-,,基本エネルギーカード,,,,,,,,,,,,,,')
print('4,雷エネルギー,雷,エネルギーカード,0,,,0,-,-,,基本エネルギーカード,,,,,,,,,,,,,,')
print('5,超エネルギー,超,エネルギーカード,0,,,0,-,-,,基本エネルギーカード,,,,,,,,,,,,,,')
print('6,闘エネルギー,闘,エネルギーカード,0,,,0,-,-,,基本エネルギーカード,,,,,,,,,,,,,,')
print('7,悪エネルギー,悪,エネルギーカード,0,,,0,,-,,基本エネルギーカード,,,,,,,,,,,,,,')
print('8,鋼エネルギー,鋼,エネルギーカード,0,,,0,,-,,基本エネルギーカード,,,,,,,,,,,,,,')
print('9,妖エネルギー,妖,エネルギーカード,0,,,0,,-,,基本エネルギーカード,,,,,,,,,,,,,,')

make_text_Data.load_data()

#pokmeon.txtで出力したあと、ShiftJIS形式に変換して'pokemon_text.dat'で出力
# nkf -s pokemon.txt > pokemon_text.dat で実行
